[
  {
    "id": 1,
    "text": "श्रीगुरु चरन सरोज रज, निज मन मुकुर सुधारि।",
    "answer": "I bow to my teacher’s feet and clean my mind like a mirror.",
    "notes": "Before learning, we calm our mind so wisdom can shine."
  },
  {
    "id": 2,
    "text": "जय हनुमान ज्ञान गुण सागर। जय कपीस तिहु लोक उजागर॥",
    "answer": "Hail Hanuman, ocean of wisdom and good qualities, shining across the world.",
    "notes": "Knowledge and kindness make you bright wherever you go."
  },
  {
    "id": 3,
    "text": "राम दूत अतुलित बल धामा। अंजनि पुत्र पवनसुत नामा॥",
    "answer": "Messenger of Ram, unmatched in strength, son of Anjani and the Wind.",
    "notes": "Real strength is used in service of others."
  },
  {
    "id": 4,
    "text": "महाबीर बिक्रम बजरंगी। कुमति निवार सुमति के संगी॥",
    "answer": "Great and brave Hanuman removes bad thoughts and brings good ones.",
    "notes": "Keep good company, it shapes your mind."
  },
  {
    "id": 5,
    "text": "कंचन बरन बिराज सुबेसा। कानन कुंडल कुंचित केसा॥",
    "answer": "Golden colored, wearing fine clothes, earrings, and curly hair.",
    "notes": "Strength and beauty come from purity inside."
  },
  {
    "id": 6,
    "text": "हाथ बज्र और ध्वजा बिराजे। कांधे मूंज जनेऊ साजे॥",
    "answer": "He holds a thunderbolt and flag, with sacred thread on his shoulder.",
    "notes": "Symbols remind us of duty and courage."
  },
  {
    "id": 7,
    "text": "शंकर सुवन केसरी नंदन। तेज प्रताप महा जग बंदन॥",
    "answer": "Son of Shiva and Kesari, his power is worshipped everywhere.",
    "notes": "Energy and devotion make one truly powerful."
  },
  {
    "id": 8,
    "text": "विद्यावान गुनी अति चातुर। राम काज करिबे को आतुर॥",
    "answer": "Wise, skilled, clever, and eager to serve Ram.",
    "notes": "Eagerness to help is the highest intelligence."
  },
  {
    "id": 9,
    "text": "प्रभु चरित्र सुनिबे को रसिया। राम लखन सीता मन बसिया॥",
    "answer": "He loves listening to Ram’s stories and holds Ram, Lakshman, and Sita in his heart.",
    "notes": "Loving good stories fills the heart with joy."
  },
  {
    "id": 10,
    "text": "सूक्ष्म रूप धरि सियहि दिखावा। बिकट रूप धरि लंक जरावा॥",
    "answer": "He took a tiny form to meet Sita and a giant form to burn Lanka.",
    "notes": "Adapt yourself — gentle when needed, strong when required."
  },
  {
    "id": 11,
    "text": "भीम रूप धरि असुर संहारे। रामचंद्र के काज संवारे॥",
    "answer": "He took a fierce form to defeat demons and help Ram’s mission.",
    "notes": "Courage protects the good."
  },
  {
    "id": 12,
    "text": "लाय संजीवन लखन जियाये। श्रीरघुबीर हरषि उर लाये॥",
    "answer": "He brought the healing herb to save Lakshman, making Ram very happy.",
    "notes": "Helping others in need is the greatest service."
  },
  {
    "id": 13,
    "text": "रघुपति कीन्ही बहुत बड़ाई। तुम मम प्रिय भरत सम भाई॥",
    "answer": "Ram praised Hanuman, saying you are as dear as my brother Bharat.",
    "notes": "True devotion earns love and respect."
  },
  {
    "id": 14,
    "text": "सहस बदन तुम्हरो जस गावैं। अस कहि श्रीपति कंठ लगावैं॥",
    "answer": "Thousands sing of Hanuman’s glory, and Ram embraced him.",
    "notes": "Good deeds spread far and bring love."
  },
  {
    "id": 15,
    "text": "सनकादिक ब्रह्मादि मुनीसा। नारद सारद सहित अहीसा॥",
    "answer": "Sages, gods, and even the serpent-king sing your praises.",
    "notes": "Wisdom is respected by all, even the wise."
  },
  {
    "id": 16,
    "text": "जम कुबेर दिगपाल जहां ते। कवि कोविद कहि सके कहां ते॥",
    "answer": "Even gods like Yamraj, Kuber, poets, and scholars cannot fully describe you.",
    "notes": "True greatness goes beyond words."
  },
  {
    "id": 17,
    "text": "तुम उपकार सुग्रीवहि कीन्हा। राम मिलाय राज पद दीन्हा॥",
    "answer": "You helped Sugriva meet Ram and regain his kingdom.",
    "notes": "Helping others find their path is noble."
  },
  {
    "id": 18,
    "text": "तुम्हरो मंत्र बिभीषन माना। लंकेस्वर भए सब जग जाना॥",
    "answer": "Vibhishan followed your advice and became king of Lanka.",
    "notes": "Wise advice can change lives."
  },
  {
    "id": 19,
    "text": "जुग सहस्र जोजन पर भानू। लील्यो ताहि मधुर फल जानू॥",
    "answer": "As a child, you leapt to the sun, thinking it was a sweet fruit.",
    "notes": "Curiosity and courage are natural strengths."
  },
  {
    "id": 20,
    "text": "प्रभु मुद्रिका मेलि मुख माहीं। जलधि लांघि गये अचरज नाहीं॥",
    "answer": "With Ram’s ring in your mouth, you crossed the ocean easily.",
    "notes": "Faith makes impossible tasks possible."
  },
  {
    "id": 21,
    "text": "दुर्गम काज जगत के जेते। सुगम अनुग्रह तुम्हरे तेते॥",
    "answer": "Difficult tasks become easy with your grace.",
    "notes": "Courage and faith turn mountains into molehills."
  },
  {
    "id": 22,
    "text": "राम दुआरे तुम रखवारे। होत न आज्ञा बिनु पैसारे॥",
    "answer": "You guard Ram’s door; no one enters without your permission.",
    "notes": "Discipline and loyalty guard values."
  },
  {
    "id": 23,
    "text": "सब सुख लहि तुम्हारी सरना। तुम रक्षक काहू को डरना॥",
    "answer": "All joy comes by taking shelter in you. With you as protector, none need fear.",
    "notes": "True faith removes fear."
  },
  {
    "id": 24,
    "text": "आपन तेज सम्हारो आपै। तीनों लोक हांक ते कांपै॥",
    "answer": "Even when you hold back your power, the three worlds tremble.",
    "notes": "Greatness lies in self-control."
  },
  {
    "id": 25,
    "text": "भूत पिशाच निकट नहिं आवै। महाबीर जब नाम सुनावै॥",
    "answer": "Ghosts and fears vanish when Hanuman’s name is heard.",
    "notes": "Faith brings courage against fear."
  },
  {
    "id": 26,
    "text": "नासै रोग हरै सब पीरा। जपत निरंतर हनुमत बीरा॥",
    "answer": "Chanting Hanuman’s name removes illness and sorrow.",
    "notes": "Positive thoughts heal the heart and body."
  },
  {
    "id": 27,
    "text": "संकट तें हनुमान छुड़ावै। मन क्रम बचन ध्यान जो लावै॥",
    "answer": "Hanuman frees from troubles if remembered with heart, actions, and words.",
    "notes": "Consistency in prayer builds inner strength."
  },
  {
    "id": 28,
    "text": "सब पर राम तपस्वी राजा। तिन के काज सकल तुम साजा॥",
    "answer": "You fulfill all tasks of Ram, the noble king.",
    "notes": "Serving the right leader makes actions meaningful."
  },
  {
    "id": 29,
    "text": "और मनोरथ जो कोई लावै। सोई अमित जीवन फल पावै॥",
    "answer": "Whoever comes with wishes gets lasting joy through you.",
    "notes": "True joy is deeper than quick rewards."
  },
  {
    "id": 30,
    "text": "चारों जुग परताप तुम्हारा। है परसिद्ध जगत उजियारा॥",
    "answer": "Your glory shines in all four ages, lighting the world.",
    "notes": "Goodness is timeless."
  },
  {
    "id": 31,
    "text": "साधु संत के तुम रखवारे। असुर निकंदन राम दुलारे॥",
    "answer": "You protect saints and defeat demons, beloved of Ram.",
    "notes": "Stand by goodness, oppose injustice."
  },
  {
    "id": 32,
    "text": "अष्ट सिद्धि नव निधि के दाता। अस बर दीन जानकी माता॥",
    "answer": "Sita blessed you to grant eight powers and nine treasures.",
    "notes": "Blessings come from humility and devotion."
  },
  {
    "id": 33,
    "text": "राम रसायन तुम्हरे पासा। सदा रहो रघुपति के दासा॥",
    "answer": "You hold Ram’s nectar and stay forever his servant.",
    "notes": "Serving good keeps you pure and happy."
  },
  {
    "id": 34,
    "text": "तुम्हरे भजन राम को पावै। जनम जनम के दुख बिसरावै॥",
    "answer": "Through devotion to you, one finds Ram and forgets sorrows.",
    "notes": "Devotion uplifts across lifetimes."
  },
  {
    "id": 35,
    "text": "अन्तकाल रघुबर पुर जाई। जहाँ जन्म हरिभक्त कहाई॥",
    "answer": "At life’s end, one reaches Ram’s abode, reborn as his devotee.",
    "notes": "Faith brings peace at life’s journey end."
  },
  {
    "id": 36,
    "text": "और देवता चित्त न धरई। हनुमत सेइ सर्ब सुख करई॥",
    "answer": "Worshipping you brings all happiness, no need to seek other gods.",
    "notes": "Focus on one path brings clarity."
  },
  {
    "id": 37,
    "text": "संकट कटै मिटै सब पीरा। जो सुमिरै हनुमत बलबीरा॥",
    "answer": "Troubles and pain end for those who remember mighty Hanuman.",
    "notes": "Remembering strength gives strength."
  },
  {
    "id": 38,
    "text": "जय जय जय हनुमान गोसाईं। कृपा करहु गुरुदेव की नाईं॥",
    "answer": "Victory to you, Hanuman! Be as kind as a great teacher.",
    "notes": "A guide’s kindness shapes the student."
  },
  {
    "id": 39,
    "text": "जो सत बार पाठ कर कोई। छूटहि बंदि महा सुख होई॥",
    "answer": "Whoever reads this 100 times is freed from bonds and gains joy.",
    "notes": "Repetition makes values sink deep."
  },
  {
    "id": 40,
    "text": "जो यह पढ़ै हनुमान चालीसा। होय सिद्धि साखी गौरीसा॥",
    "answer": "Reading this Hanuman Chalisa brings success, with Shiva as witness.",
    "notes": "Faith and effort together bring success."
  },
  {
    "id": 41,
    "text": "तुलसीदास सदा हरि चेरा। कीजै नाथ हृदय मह डेरा॥",
    "answer": "Tulsidas says: I am always servant of God, please live in my heart.",
    "notes": "Humility keeps love of God inside forever."
  }
]